app/controllers/dynamic_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
	def restaurants
		@recommended = Restaurant.all

INSERT INTO "restaurants" ("created_at", "cuisine", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Apr 2012 16:02:50 UTC +00:00], ["cuisine", "Amercian"], ["name", "Red Robin"], ["updated_at", Thu, 26 Apr 2012 16:02:50 UTC +00:00]]
---
	def create

		# new_recommedation = Restaurant.new
		# new_recommedation.cuisine = params[:cuisine]
		# new_recommedation.name = params[:name]

		new_recommedation = Restaurant.new(:name => params[:name], :cuisine => params[:cuisine])

		new_recommedation.save

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 1 LIMIT 1
---
	def restaurant_info
		@restaurant_info = Restaurant.find_by_id(params[:id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 1 LIMIT 1
---
	def edit
		@restaurant = Restaurant.find_by_id(params[:id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 6 LIMIT 1
UPDATE "restaurants" SET "name" = 'Chipotle', "cuisine" = 'Fast Mexican', "updated_at" = '2012-04-28 18:10:43.654881' WHERE "restaurants"."id" = 6
---
	def update
		restaurant_change = Restaurant.find_by_id(params[:id])
		restaurant_change.name = params[:name]
		restaurant_change.cuisine = params[:cuisine]
		restaurant_change.save

DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 6]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 6 LIMIT 1
---
	def delete
		restaurant_delete = Restaurant.find_by_id(params[:id]).destroy